SigninLogs
| where TimeGenerated >= ago(90d)
| where Location !in ("CZ")
| extend d = parse_json(AuthenticationDetails)
| where d[0].succeeded == true
| summarize make_set(Location) by UserPrincipalName
