SigninLogs
| where TimeGenerated >= ago(90d)
| where ResultType in (50074,50203,500121,0)
| where isnotempty(Location) and Location != "CZ"
| summarize max(TimeGenerated),min(TimeGenerated),count() by UserPrincipalName,Location,ResultType
