SecurityEvent
| where TimeGenerated >= ago(1d)
| where EventID == 4688
| where NewProcessName has_any ("powershell.exe","pwsh.exe")
| where CommandLine contains "New-PSSession" or CommandLine contains "-encodedcommand"
| parse kind=regex flags=i CommandLine with * "-EncodedCommand " encodedCommand
| extend decodedCommand = base64_decode_tostring(substring(encodedCommand, 0, strlen(encodedCommand) - (strlen(encodedCommand) %8)))
| where decodedCommand contains "New-PSSession" or CommandLine contains "New-PSSession"
| project TimeGenerated, Account, AccountType, Computer, CommandLine, SubjectAccount, SubjectDomainName, SubjectUserName, SubjectUserSid, TargetAccount, TargetDomainName, TargetUserName, TargetUserSid, decodedCommand
